# MAIN
token = '2d440f5e040845ad56935f31fba7996de6d27a73eb46ca5f878b08e0877101d5c9f8b2151fd9860f34e7f'
g_id = 191045351
rules_id = 40127809
rooms_id = 40127903
jobs_id = 47181611
blanks_id = 40127849
admins = [236002216, 253857572, 335494103, 465023668, 404343302, 438547215]
chat_not_admin = 'Команды в беседах разрешены только админам'
user_not_admin = 'Эта команда разрешена только админам'
database = r'C:\Users\IT-Квантум_Якт\Documents\VK Projects\rosemarin\data.db'
first_msg = '''Вас приветствует администрация Общежития Розмарин. 
Пожалуйста, воспользуйтесь нашим ботом.'''
cmd_list = '''Команды для бота:
/rules - получить правила
/char - получить информацию по персонажу
/toadmin - обратиться к администрации

Список команд будет пополняться с дополнением функционала.
Если вы заметите ошибки в работе бота или у вас есть какие-либо предложения, просьба направить их администрации.'''


# APP
api_key = '3e023bdd3e023bdd3e023bddfb3e71a19e33e023e023bdd61411c47cec5fc5b77b4ab9e'


# RULES
rules_noarg = '''Напишите команду с указанием раздела:
/rules 0 - Все правила
/rules 1 - Анкета
/rules 2 - Ролевая
/rules 3 - Флуд
/rules 4 - Прочее'''


# JOBS
jobs_noarg = '''Напишите комманду с указанием раздела:
/jobs
/jobs
/jobs
/jobs'''


# CHARACTERS
persinfo_noarg = '''Напишите команду с указанием персонажа:
/char [имя персонажа] (если персонажей с одинаковым именем несколько, то укажите фамилию)'''
char_info = ['Имя: ', '\nВладелец: ', '\nСтраница владельца: ']
char_not_found = 'Персонаж не найден!'
char_no_blank = 'Невозможно получить анкету, не найдя персонажа с помощью "/char"'
